docs: muda o diagrama atual da doc para mermaid
